# 删除重复值

In [1]:
import numpy as np
import pandas as pd

In [5]:
data = pd.DataFrame({'k1':['one', 'two']*3+['two'],
                    'k2':[1, 1, 2, 3, 3, 4, 4]})

In [6]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [7]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [9]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [13]:
data['v1'] = range(7)

In [14]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [17]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [16]:
data.duplicated('k1')

0    False
1    False
2     True
3     True
4     True
5     True
6     True
dtype: bool

In [18]:
data.drop_duplicates(['k1', 'k2'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

In [19]:
data.duplicated(['k1','k2'])

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool